'''Створіть масив зі строками, які будуть складатися з чисел, які розділені комою.
Наприклад: [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”'''

def count_sum_of_each_list(lst):
    try:
        new_lst = lst.split(',')
        int_new_list = [int(x) for x in new_lst]
        return sum(int_new_list)
    except ValueError:
        return "Не можу це зробити!"

data_list = ['1,2,3,4', '1,2,3,4,50', 'qwerty1,2,3']

for list_elements in data_list:
    result = count_sum_of_each_list(list_elements)
    print(result)